---
---

<center><h1>üìç üìç Assignment: Sorting and Aggregating Data üìç üìç</h1></center>

---

#### `READ THE DATASET`

---

In [172]:
import pandas as pd

In [174]:
data = pd.read_csv('time_series.csv')
print(data)

          ID          Datetime  Count
0          0  25-08-2012 00:00      8
1          1  25-08-2012 01:00      2
2          2  25-08-2012 02:00      6
3          3  25-08-2012 03:00      2
4          4  25-08-2012 04:00      2
...      ...               ...    ...
18283  18283  25-09-2014 19:00    868
18284  18284  25-09-2014 20:00    732
18285  18285  25-09-2014 21:00    702
18286  18286  25-09-2014 22:00    580
18287  18287  25-09-2014 23:00    534

[18288 rows x 3 columns]

In [176]:
data.head()

   ID          Datetime  Count
0   0  25-08-2012 00:00      8
1   1  25-08-2012 01:00      2
2   2  25-08-2012 02:00      6
3   3  25-08-2012 03:00      2
4   4  25-08-2012 04:00      2

In [178]:
data.dtypes

ID           int64
Datetime    object
Count        int64
dtype: object

#### `Convert the Datetime column to pandas datetime object`

---

In [181]:
# Convert the 'Datetime' column to pandas datetime
data['Datetime']=pd.to_datetime(data['Datetime'])
# Display the updated DataFrame info
print(data)

          ID            Datetime  Count
0          0 2012-08-25 00:00:00      8
1          1 2012-08-25 01:00:00      2
2          2 2012-08-25 02:00:00      6
3          3 2012-08-25 03:00:00      2
4          4 2012-08-25 04:00:00      2
...      ...                 ...    ...
18283  18283 2014-09-25 19:00:00    868
18284  18284 2014-09-25 20:00:00    732
18285  18285 2014-09-25 21:00:00    702
18286  18286 2014-09-25 22:00:00    580
18287  18287 2014-09-25 23:00:00    534

[18288 rows x 3 columns]

C:\Users\YOSHVA.J\AppData\Local\Temp\ipykernel_15808\400518243.py:2: UserWarning: Parsing dates in %d-%m-%Y %H:%M format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  data['Datetime']=pd.to_datetime(data['Datetime'])

---

####  `Create the following features using the Datetime feature`

- day of month
- month
- day of year
- hour

---

In [184]:

data['Datetime'] = pd.to_datetime(data['Datetime'])

data['day_of_month'] = data['Datetime'].dt.day
data['month'] = data['Datetime'].dt.month
data['day_of_year'] = data['Datetime'].dt.dayofyear
data['hour'] = data['Datetime'].dt.hour
print(data[['Datetime', 'day_of_month', 'month', 'day_of_year', 'hour']].head())

             Datetime  day_of_month  month  day_of_year  hour
0 2012-08-25 00:00:00            25      8          238     0
1 2012-08-25 01:00:00            25      8          238     1
2 2012-08-25 02:00:00            25      8          238     2
3 2012-08-25 03:00:00            25      8          238     3
4 2012-08-25 04:00:00            25      8          238     4

---

#### `Consider the following dataframe`

---

In [187]:
sample_df = pd.DataFrame({
    'id'   :  [1, 2, 3, 4, 5],
    'name' :  [ 'Akash', 'Akansha', 'Naman', 'Pulkit', 'Anand'],
    'marks':  [ 22, 23, 43, 41, 12]
})
sample_df

   id     name  marks
0   1    Akash     22
1   2  Akansha     23
2   3    Naman     43
3   4   Pulkit     41
4   5    Anand     12

#### Sort the  dataframe by `marks` column in descending order

---

In [190]:
sorted_df=sample_df.sort_values(by='marks',ascending=False)
print(sorted_df)

   id     name  marks
2   3    Naman     43
3   4   Pulkit     41
1   2  Akansha     23
0   1    Akash     22
4   5    Anand     12

#### Consider another dataframe city
---

In [193]:
city = pd.DataFrame({
    'name' : ['Akash', 'Akansha', 'Pulkit', 'Anand', 'Naman'],
    'city' : ['Delhi', 'Gurugram', 'Gurugram', 'Delhi', 'Noida']
})
city

      name      city
0    Akash     Delhi
1  Akansha  Gurugram
2   Pulkit  Gurugram
3    Anand     Delhi
4    Naman     Noida

***Use the dataframe `sample_df` and `city` and find out the marks of students who live in Gurugram.***

---

In [196]:
merged_df=pd.merge(sample_df,city,on='name')
gurugram_students=merged_df[merged_df['city']=='Gurugram']
print(gurugram_students[['name','marks']])

      name  marks
1  Akansha     23
3   Pulkit     41

#### `READ THE BIG MART SALES DATA`

---

In [199]:
big_mart_data = pd.read_csv('big_mart_sales.csv')

In [201]:
big_mart_data.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.92,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.20,Regular,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,NaN,Tier 3,Grocery Store,732.3800
4,NCD19,8.93,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052

#### Find out the number of unique `Item_Type` in each of the `Outlet_Identifier`

---

In [224]:
big_mart_data.groupby('Outlet_Identifier')['Item_Type'].unique()

Outlet_Identifier
OUT010    [Fruits and Vegetables, Dairy, Snack Foods, Ca...
OUT013    [Household, Snack Foods, Fruits and Vegetables...
OUT017    [Frozen Foods, Household, Fruits and Vegetable...
OUT018    [Soft Drinks, Baking Goods, Health and Hygiene...
OUT019    [Baking Goods, Canned, Dairy, Frozen Foods, Ho...
OUT027    [Snack Foods, Hard Drinks, Baking Goods, Fruit...
OUT035    [Dairy, Household, Snack Foods, Meat, Fruits a...
OUT045    [Frozen Foods, Breads, Health and Hygiene, Can...
OUT046    [Dairy, Snack Foods, Breakfast, Frozen Foods, ...
OUT049    [Dairy, Meat, Fruits and Vegetables, Breakfast...
Name: Item_Type, dtype: object

#### Find out the average `Item_Outlet_Sales` for each category of `Outlet_Size`

---

In [229]:
big_mart_data.groupby('Outlet_Size')['Item_Outlet_Sales'].mean()

Outlet_Size
High      2298.995256
Medium    2681.603542
Small     1912.149161
Name: Item_Outlet_Sales, dtype: float64

#### Select only the categorical variables from the dataframe and use `get_dummies` function to convert those into the numerical ones. 

---

In [239]:
data1=big_mart_data.select_dtypes(include='object')
encd_data=pd.get_dummies(data1)
print(encd_data.head())

   Item_Identifier_DRA12  Item_Identifier_DRA24  Item_Identifier_DRA59  \
0                  False                  False                  False
1                  False                  False                  False
2                  False                  False                  False
3                  False                  False                  False
4                  False                  False                  False

   Item_Identifier_DRB01  Item_Identifier_DRB13  Item_Identifier_DRB24  \
0                  False                  False                  False
1                  False                  False                  False
2                  False                  False                  False
3                  False                  False                  False
4                  False                  False                  False

   Item_Identifier_DRB25  Item_Identifier_DRB48  Item_Identifier_DRC01  \
0                  False                  False                  False
1                  False                  False                   True
2                  False                  False                  False
3                  False                  False                  False
4                  False                  False                  False

   Item_Identifier_DRC12  ...  Outlet_Size_High  Outlet_Size_Medium  \
0                  False  ...             False                True
1                  False  ...             False                True
2                  False  ...             False                True
3                  False  ...             False               False
4                  False  ...              True               False

   Outlet_Size_Small  Outlet_Location_Type_Tier 1  \
0              False                         True
1              False                        False
2              False                         True
3              False                        False
4              False                        False

   Outlet_Location_Type_Tier 2  Outlet_Location_Type_Tier 3  \
0                        False                        False
1                        False                         True
2                        False                        False
3                        False                         True
4                        False                         True

   Outlet_Type_Grocery Store  Outlet_Type_Supermarket Type1  \
0                      False                           True
1                      False                          False
2                      False                           True
3                       True                          False
4                      False                           True

   Outlet_Type_Supermarket Type2  Outlet_Type_Supermarket Type3
0                          False                          False
1                           True                          False
2                          False                          False
3                          False                          False
4                          False                          False

[5 rows x 1600 columns]